### Table of content
#### Importing libraries
#### Importing data
#### Data inspection
#### Data cleaning
#### Summmary statistics
#### Exporting clean data

### Importing libraries

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import scipy
import os

### Importing data

In [5]:
data = pd.read_csv(r"C:\Users\tseki\OneDrive\Documents\Careerfoundry\Data immersion\Achievement 6\Data\Original\realtor-data.csv")

### Data inspection

In [6]:
data.head()

,status,price,bed,bath,acre_lot,full_address,street,city,state,zip_code,house_size,sold_date
0,for_sale,105000.0,3.0,2.0,0.12,"Sector Yahuecas Titulo # V84, Adjuntas, PR, 00601",Sector Yahuecas Titulo # V84,Adjuntas,Puerto Rico,601.0,920.0,NaN
1,for_sale,80000.0,4.0,2.0,0.08,"Km 78 9 Carr # 135, Adjuntas, PR, 00601",Km 78 9 Carr # 135,Adjuntas,Puerto Rico,601.0,1527.0,NaN
2,for_sale,67000.0,2.0,1.0,0.15,"556G 556-G 16 St, Juana Diaz, PR, 00795",556G 556-G 16 St,Juana Diaz,Puerto Rico,795.0,748.0,NaN
3,for_sale,145000.0,4.0,2.0,0.10,"R5 Comunidad El Paraso Calle De Oro R-5 Ponce,...",R5 Comunidad El Paraso Calle De Oro R-5 Ponce,Ponce,Puerto Rico,731.0,1800.0,NaN
4,for_sale,65000.0,6.0,2.0,0.05,"14 Navarro, Mayaguez, PR, 00680",14 Navarro,Mayaguez,Puerto Rico,680.0,NaN,NaN

In [8]:
data.shape

(923159, 12)

In [24]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 923159 entries, 0 to 923158
Data columns (total 12 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   status        923159 non-null  object
 1   price         923088 non-null  float64
 2   bed           791456 non-null  float64
 3   bath          807967 non-null  float64
 4   acre_lot      649536 non-null  float64
 5   full_address  923159 non-null  object
 6   street        921021 non-null  object
 7   city          923085 non-null  object
 8   state         923159 non-null  object
 9   zip_code      922954 non-null  float64
 10  house_size    625316 non-null  float64
 11  sold_date     456396 non-null  object
dtypes: float64(6), object(6)
memory usage: 84.5+ MB

In [9]:
# I am interested only in Massachusetts data
# I will check value count of states to see if there are multiple representation of Massachusetts

data['state'].value_counts(dropna = False)

New Jersey        233722
New York          211778
Massachusetts     175248
Connecticut        91644
New Hampshire      51394
Vermont            46460
Maine              36650
Rhode Island       29596
Puerto Rico        24679
Pennsylvania       17148
Virgin Islands      2573
Delaware            2135
Georgia               50
Virginia              31
South Carolina        25
Tennessee             20
Wyoming                3
West Virginia          3
Name: state, dtype: int64

In [10]:
# I will select only Massachusetts data and assign it to a new dataframe

MA_data = data[data['state']=='Massachusetts']

In [11]:
# Checking shape
MA_data.shape

(175248, 12)

In [12]:
# Checking value counts of bed
MA_data['bed'].value_counts(dropna = False)

3.0     44396
2.0     38135
4.0     28003
NaN     26108
1.0     11814
5.0     10636
6.0      6632
7.0      2308
8.0      2103
9.0      1845
12.0      913
10.0      654
11.0      507
15.0      202
14.0      123
18.0      117
13.0      108
19.0       86
20.0       86
16.0       86
24.0       72
17.0       67
22.0       46
28.0       35
42.0       28
60.0       27
99.0       23
86.0       21
32.0       21
31.0       17
33.0       10
21.0        8
49.0        8
27.0        3
Name: bed, dtype: int64

In [13]:
# i am only interested in properties with less than 16 bedrooms
MA_data = MA_data[MA_data['bed'] <= 15]

In [14]:
# Checking shapee
MA_data.shape

(148379, 12)

### Data cleaning

In [16]:
# checking for duplicates

MA_data.duplicated().sum()

139926

In [17]:
# There are many duplicate records, we would remove them.

MA_data.drop_duplicates(inplace=True)

In [18]:
# Checking shape

MA_data.shape

(8453, 12)

In [19]:
MA_data['status'].value_counts(dropna = False)

for_sale          8412
ready_to_build      41
Name: status, dtype: int64

In [21]:
MA_data.tail(10)

,status,price,bed,bath,acre_lot,full_address,street,city,state,zip_code,house_size,sold_date
220455,for_sale,2900000.0,5.0,4.0,4.20,"564 River Rd, Westport, MA, 02790",564 River Rd,Westport,Massachusetts,2790.0,3740.0,NaN
220505,for_sale,450000.0,3.0,3.0,0.33,"419 Olney St, Seekonk, MA, 02771",419 Olney St,Seekonk,Massachusetts,2771.0,1782.0,1999-12-13
227070,for_sale,560000.0,4.0,2.0,0.20,"54 Plainfield Ave, Shrewsbury, MA, 01545",54 Plainfield Ave,Shrewsbury,Massachusetts,1545.0,2640.0,1998-09-28
233354,for_sale,650000.0,6.0,4.0,0.15,"12 Cedar Dr, Webster, MA, 01570",12 Cedar Dr,Webster,Massachusetts,1570.0,4012.0,1988-08-12
339024,for_sale,175000.0,4.0,1.0,0.48,"560 Country Club Rd, Greenfield, MA, 01301",560 Country Club Rd,Greenfield,Massachusetts,1301.0,1163.0,NaN
341449,for_sale,380000.0,3.0,2.0,0.21,"74 Pondview Dr, Chicopee, MA, 01020",74 Pondview Dr,Chicopee,Massachusetts,1020.0,1336.0,2006-03-10
418268,for_sale,374900.0,3.0,1.0,0.27,"16 Lancaster St, Auburn, MA, 01501",16 Lancaster St,Auburn,Massachusetts,1501.0,1098.0,NaN
418274,for_sale,499000.0,6.0,6.0,0.14,"26 Old West Brookfield Rd, Warren, MA, 01083",26 Old West Brookfield Rd,Warren,Massachusetts,1083.0,3240.0,NaN
424916,for_sale,399900.0,4.0,3.0,0.43,"24 N Main St, West Brookfield, MA, 01585",24 N Main St,West Brookfield,Massachusetts,1585.0,2968.0,2006-07-12
424923,for_sale,339900.0,3.0,1.0,0.17,"12 Suburban Rd, Worcester, MA, 01602",12 Suburban Rd,Worcester,Massachusetts,1602.0,1500.0,2005-11-29

In [22]:
# dropping irrelevant columns

MA_data = MA_data.drop(columns=['street', 'full_address'])

In [23]:
MA_data.head()

,status,price,bed,bath,acre_lot,city,state,zip_code,house_size,sold_date
24231,for_sale,180000.0,2.0,1.0,0.34,Agawam,Massachusetts,1001.0,676.0,NaN
24233,for_sale,169900.0,2.0,2.0,NaN,Agawam,Massachusetts,1001.0,892.0,2019-04-30
24234,for_sale,242000.0,2.0,2.0,NaN,Agawam,Massachusetts,1001.0,1428.0,NaN
24235,for_sale,299950.0,2.0,2.0,NaN,Agawam,Massachusetts,1001.0,1659.0,NaN
24236,for_sale,239900.0,3.0,1.0,0.46,Agawam,Massachusetts,1001.0,1196.0,NaN

In [25]:
# changing data type of sold_date to datetime

MA_data["sold_date"] = pd.to_datetime(MA_data["sold_date"])

In [31]:
# Inspecting the sold_date column

MA_data['sold_date'].sort_values(ascending=False).head()

199073   2022-12-01
199094   2022-09-30
199034   2022-06-01
198698   2022-05-31
198999   2022-05-30
Name: sold_date, dtype: datetime64[ns]

In [35]:
MA_data['sold_date'].sort_values().head(20)

54624    1901-01-01
54619    1910-01-29
104272   1952-12-21
112812   1955-02-24
112534   1957-09-26
73394    1961-09-22
133856   1963-10-23
133673   1963-12-19
112765   1964-09-01
121913   1965-01-01
104119   1965-03-08
122588   1966-01-01
88844    1966-10-17
113328   1967-02-20
77742    1968-01-01
104181   1968-04-02
166780   1968-05-31
79920    1968-07-01
103218   1970-03-13
103800   1971-03-31
Name: sold_date, dtype: datetime64[ns]

In [46]:
# This data was accessed September 12th, 2022. We apparently can't have a future sold date, that is an error.
# Also, we would discard data older than year 1960.

MA_data1 = MA_data[MA_data['sold_date'] < pd.to_datetime("2022-08-31")]

In [48]:
MA_data1 = MA_data1[MA_data1['sold_date'] > pd.to_datetime("1959-12-31")]

In [59]:
# Checking output

MA_data1['sold_date'].sort_values().head(10)

73394    1961-09-22
133856   1963-10-23
133673   1963-12-19
112765   1964-09-01
121913   1965-01-01
104119   1965-03-08
122588   1966-01-01
88844    1966-10-17
113328   1967-02-20
77742    1968-01-01
Name: sold_date, dtype: datetime64[ns]

In [62]:
MA_data1.shape

(3945, 10)

In [64]:
# checking for missing values

MA_data1.isnull().sum()

status          0
price           0
bed             0
bath            1
acre_lot      893
city            0
state           0
zip_code        0
house_size      3
sold_date       0
dtype: int64

In [68]:
# I would like to use the actual data for predicting and would rather remove missing records instead of imputing data.

MA_data1.dropna(axis = 0, inplace = True)

In [69]:
# checking output

MA_data1.shape

(3048, 10)

In [71]:
# changing zip code data type from 'float' to 'object'

MA_data1['zip_code'] = MA_data1['zip_code'].astype(str)

In [74]:
# confirming that data we're using is only for Massachusetts

MA_data1['state'].value_counts(dropna = False)

Massachusetts    3048
Name: state, dtype: int64

In [78]:
# dropping state column

MA_data1.drop(columns = ['state'], inplace = True)

In [86]:
# checking value count of status column

MA_data1['status'].value_counts(dropna = False)

for_sale    3048
Name: status, dtype: int64

In [87]:
# dropping status column since we have just one unique value, 'for_sale'

MA_data1.drop(columns = ['status'], inplace = True)

In [88]:
MA_data1.shape

(3048, 8)

### Summary statistics

In [72]:
# Checking the summary statistics of my clean data

MA_data1.describe()

              price          bed         bath     acre_lot    house_size
count  3.048000e+03  3048.000000  3048.000000  3048.000000   3048.000000
mean   1.059353e+06     3.668963     2.722441     1.387487   2433.718504
std    1.651959e+06     1.576512     1.615195     8.869902   1765.801508
min    1.000000e+04     1.000000     1.000000     0.000000    170.000000
25%    4.299000e+05     3.000000     2.000000     0.140000   1376.750000
50%    6.150000e+05     3.000000     2.000000     0.300000   1983.500000
75%    9.499000e+05     4.000000     3.000000     0.710000   2870.000000
max    2.800000e+07    15.000000    15.000000   298.000000  19311.000000

In [82]:
MA_data1['zip_code'].mode()

0    1201.0
Name: zip_code, dtype: object

In [91]:
MA_data1['city'].mode()

0    Boston
Name: city, dtype: object

In [89]:
# checking number of unique values in all columns of the dataset

MA_data1.nunique()

price          860
bed             15
bath            15
acre_lot       384
city           346
zip_code       433
house_size    1886
sold_date     2315
dtype: int64

### Exporting clean data

In [98]:
MA_data1.to_csv(r"C:\Users\tseki\OneDrive\Documents\Careerfoundry\Data immersion\Achievement 6\Data\Prepared\MA_clean_data.csv")